Duet3D/Duet3Expansion/src/atmel/SAMC20_DFP/1.1.95/samc20/atdf/ATSAMC20E17A.atdf
          </instance>
        </module><module name="SysTick">
          <instance name="SysTick">
            <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
          </instance>
        </module><module name="NVIC">
          <instance name="NVIC">
            <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
          </instance>
        </module></peripherals>
      <interrupts>
        <interrupt name="NonMaskableInt_IRQn" index="-14" caption="Non Maskable Interrupt"/>
        <interrupt name="HardFault_IRQn" index="-13" caption="Cortex-M0+ Hard Fault Interrupt"/>
        <interrupt name="SVCall_IRQn" index="-5" caption="Cortex-M0+ SV Call Interrupt"/>
        <interrupt name="PendSV_IRQn" index="-2" caption="Cortex-M0+ Pend SV Interrupt"/>
        <interrupt name="SysTick_IRQn" index="-1" caption="Cortex-M0+ System Tick Interrupt"/>
        <interrupt name="MCLK_IRQn" index="0" module-instance="MCLK"/>
        <interrupt name="OSCCTRL_IRQn" index="0" module-instance="OSCCTRL"/>
        <interrupt name="OSC32KCTRL_IRQn" index="0" module-instance="OSC32KCTRL"/>
        <interrupt name="PAC_IRQn" index="0" module-instance="PAC"/>
        <interrupt name="PM_IRQn" index="0" module-instance="PM"/>
        <interrupt name="SUPC_IRQn" index="0" module-instance="SUPC"/>
        <interrupt name="TAL_IRQn" index="0" module-instance="TAL"/>
        <interrupt name="WDT_IRQn" index="1" module-instance="WDT"/>
        <interrupt name="RTC_IRQn" index="2" module-instance="RTC"/>
        <interrupt name="EIC_IRQn" index="3" module-instance="EIC"/>
        <interrupt name="FREQM_IRQn" index="4" module-instance="FREQM"/>
        <interrupt name="NVMCTRL_IRQn" index="6" module-instance="NVMCTRL"/>
        <interrupt name="DMAC_IRQn" index="7" module-instance="DMAC"/>
        <interrupt name="EVSYS_IRQn" index="8" module-instance="EVSYS"/>
        <interrupt name="SERCOM0_IRQn" index="9" module-instance="SERCOM0"/>
        <interrupt name="SERCOM1_IRQn" index="10" module-instance="SERCOM1"/>
        <interrupt name="SERCOM2_IRQn" index="11" module-instance="SERCOM2"/>
        <interrupt name="SERCOM3_IRQn" index="12" module-instance="SERCOM3"/>
        <interrupt name="TCC0_IRQn" index="17" module-instance="TCC0"/>
        <interrupt name="TCC1_IRQn" index="18" module-instance="TCC1"/>
        <interrupt name="TCC2_IRQn" index="19" module-instance="TCC2"/>
        <interrupt name="TC0_IRQn" index="20" module-instance="TC0"/>
        <interrupt name="TC1_IRQn" index="21" module-instance="TC1"/>
        <interrupt name="TC2_IRQn" index="22" module-instance="TC2"/>
        <interrupt name="TC3_IRQn" index="23" module-instance="TC3"/>
        <interrupt name="TC4_IRQn" index="24" module-instance="TC4"/>
        <interrupt name="ADC0_IRQn" index="25" module-instance="ADC0"/>
        <interrupt name="AC_IRQn" index="27" module-instance="AC"/>
        <interrupt name="PTC_IRQn" index="30" module-instance="PTC"/>
      </interrupts>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x1100040B"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="U2245" version="1.1.1" caption="Analog Comparators">
      <register-group name="AC" caption="Analog Comparators">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="W" size="1" initval="0x00" caption="Control B">
          <bitfield name="START0" caption="Comparator 0 Start Comparison" mask="0x1"/>
          <bitfield name="START1" caption="Comparator 1 Start Comparison" mask="0x2"/>
          <bitfield name="START2" caption="Comparator 2 Start Comparison" mask="0x4"/>
          <bitfield name="START3" caption="Comparator 3 Start Comparison" mask="0x8"/>
        </register>
        <register name="EVCTRL" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Event Control">
          <bitfield name="COMPEO0" caption="Comparator 0 Event Output Enable" mask="0x1"/>
          <bitfield name="COMPEO1" caption="Comparator 1 Event Output Enable" mask="0x2"/>
          <bitfield name="COMPEO2" caption="Comparator 2 Event Output Enable" mask="0x4"/>
          <bitfield name="COMPEO3" caption="Comparator 3 Event Output Enable" mask="0x8"/>
          <bitfield name="WINEO0" caption="Window 0 Event Output Enable" mask="0x10"/>
          <bitfield name="COMPEI0" caption="Comparator 0 Event Input Enable" mask="0x100"/>
          <bitfield name="COMPEI1" caption="Comparator 1 Event Input Enable" mask="0x200"/>
          <bitfield name="COMPEI2" caption="Comparator 2 Event Input Enable" mask="0x400"/>
          <bitfield name="COMPEI3" caption="Comparator 3 Event Input Enable" mask="0x800"/>
          <bitfield name="INVEI0" caption="Comparator 0 Input Event Invert Enable" mask="0x1000"/>
          <bitfield name="INVEI1" caption="Comparator 1 Input Event Invert Enable" mask="0x2000"/>
          <bitfield name="INVEI2" caption="Comparator 2 Input Event Invert Enable" mask="0x4000"/>
          <bitfield name="INVEI3" caption="Comparator 3 Input Event Invert Enable" mask="0x8000"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="COMP2" caption="Comparator 2 Interrupt Enable" mask="0x4"/>
          <bitfield name="COMP3" caption="Comparator 3 Interrupt Enable" mask="0x8"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x10"/>
        </register>
