Duet3D/Duet3Expansion/src/atmel/SAMC20_DFP/1.1.95/samc20/atdf/ATSAMC20E17A.atdf
      <value-group name="SUPC_BODVDD__ACTION">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="RESET" caption="The BOD33 generates a reset" value="0x1"/>
        <value name="INT" caption="The BOD33 generates an interrupt" value="0x2"/>
      </value-group>
      <value-group name="SUPC_BODVDD__PSEL">
        <value name="DIV2" caption="Divide clock by 2" value="0x0"/>
        <value name="DIV4" caption="Divide clock by 4" value="0x1"/>
        <value name="DIV8" caption="Divide clock by 8" value="0x2"/>
        <value name="DIV16" caption="Divide clock by 16" value="0x3"/>
        <value name="DIV32" caption="Divide clock by 32" value="0x4"/>
        <value name="DIV64" caption="Divide clock by 64" value="0x5"/>
        <value name="DIV128" caption="Divide clock by 128" value="0x6"/>
        <value name="DIV256" caption="Divide clock by 256" value="0x7"/>
        <value name="DIV512" caption="Divide clock by 512" value="0x8"/>
        <value name="DIV1024" caption="Divide clock by 1024" value="0x9"/>
        <value name="DIV2048" caption="Divide clock by 2048" value="0xA"/>
        <value name="DIV4096" caption="Divide clock by 4096" value="0xB"/>
        <value name="DIV8192" caption="Divide clock by 8192" value="0xC"/>
        <value name="DIV16384" caption="Divide clock by 16384" value="0xD"/>
        <value name="DIV32768" caption="Divide clock by 32768" value="0xE"/>
        <value name="DIV65536" caption="Divide clock by 65536" value="0xF"/>
      </value-group>
      <value-group name="SUPC_BODCORE__ACTION">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="RESET" caption="The BOD12 generates a reset" value="0x1"/>
        <value name="INT" caption="The BOD12 generates an interrupt" value="0x2"/>
      </value-group>
      <value-group name="SUPC_BODCORE__PSEL">
        <value name="DIV2" caption="Divide clock by 2" value="0x0"/>
        <value name="DIV4" caption="Divide clock by 4" value="0x1"/>
        <value name="DIV8" caption="Divide clock by 8" value="0x2"/>
        <value name="DIV16" caption="Divide clock by 16" value="0x3"/>
        <value name="DIV32" caption="Divide clock by 32" value="0x4"/>
        <value name="DIV64" caption="Divide clock by 64" value="0x5"/>
        <value name="DIV128" caption="Divide clock by 128" value="0x6"/>
        <value name="DIV256" caption="Divide clock by 256" value="0x7"/>
        <value name="DIV512" caption="Divide clock by 512" value="0x8"/>
        <value name="DIV1024" caption="Divide clock by 1024" value="0x9"/>
        <value name="DIV2048" caption="Divide clock by 2048" value="0xA"/>
        <value name="DIV4096" caption="Divide clock by 4096" value="0xB"/>
        <value name="DIV8192" caption="Divide clock by 8192" value="0xC"/>
        <value name="DIV16384" caption="Divide clock by 16384" value="0xD"/>
        <value name="DIV32768" caption="Divide clock by 32768" value="0xE"/>
        <value name="DIV65536" caption="Divide clock by 65536" value="0xF"/>
      </value-group>
      <value-group name="SUPC_VREF__SEL">
        <value name="1V024" caption="1.024V voltage reference typical value" value="0x0"/>
        <value name="2V048" caption="2.048V voltage reference typical value" value="0x2"/>
        <value name="4V096" caption="4.096V voltage reference typical value" value="0x3"/>
      </value-group>
    </module>
    <module name="TAL" id="U2253" version="1.0.3" caption="Trigger Allocator">
      <register-group name="CTIS" size="0x2">
        <register name="CTICTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Cross-Trigger Interface n Control A">
          <bitfield name="ACTION" caption="Action when global break issued" mask="0x3" values="TAL_CTICTRLA__ACTION"/>
          <bitfield name="RESTART" caption="Action when global restart issued" mask="0x4"/>
        </register>
        <register name="CTIMASK" offset="0x1" rw="RW" size="1" initval="0x00" caption="Cross-Trigger Interface n Mask">
          <bitfield name="CM0P" caption="CM0P Break Master" mask="0x1"/>
          <bitfield name="EVBRK" caption="Event Break Master" mask="0x40"/>
          <bitfield name="EXTBRK" caption="External Break Master" mask="0x80"/>
        </register>
      </register-group>
      <register-group name="TAL" caption="Trigger Allocator">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="RSTCTRL" offset="0x4" rw="RW" size="1" initval="0x00" caption="Reset Control">
        </register>
        <register name="EXTCTRL" offset="0x5" rw="RW" size="1" initval="0x00" caption="External Break Control">
          <bitfield name="ENABLE" caption="Enable BRK Pin" mask="0x1"/>
          <bitfield name="INV" caption="Invert BRK Pin" mask="0x2"/>
        </register>
        <register name="EVCTRL" offset="0x6" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="BRKEI" caption="Break Input Event Enable" mask="0x1"/>
          <bitfield name="BRKEO" caption="Break Output Event Enable" mask="0x2"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="BRK" caption="Break Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="BRK" caption="Break Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0xA" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="BRK" caption="Break" mask="0x1"/>
        </register>
        <register name="GLOBMASK" offset="0xB" rw="RW" size="1" initval="0x00" caption="Global Break Requests Mask">
          <bitfield name="CM0P" caption="CM0P Break Master" mask="0x1"/>
          <bitfield name="EVBRK" caption="Event Break Master" mask="0x40"/>
          <bitfield name="EXTBRK" caption="External Break Master" mask="0x80"/>
        </register>
        <register name="HALT" offset="0xC" rw="W" size="1" initval="0x00" caption="Debug Halt Request">
          <bitfield name="CM0P" caption="CM0P Break Master" mask="0x1"/>
          <bitfield name="EVBRK" caption="Event Break Master" mask="0x40"/>
          <bitfield name="EXTBRK" caption="External Break Master" mask="0x80"/>
        </register>
        <register name="RESTART" offset="0xD" rw="W" size="1" initval="0x00" caption="Debug Restart Request">
          <bitfield name="CM0P" caption="CM0P Break Master" mask="0x1"/>
          <bitfield name="EXTBRK" caption="External Break Master" mask="0x80"/>
        </register>
        <register name="BRKSTATUS" offset="0xE" rw="R" size="2" initval="0x0000" caption="Break Request Status">
          <bitfield name="CM0P" caption="CM0P Break Request" mask="0x3"/>
          <bitfield name="EVBRK" caption="Event Break Request" mask="0x3000"/>
          <bitfield name="EXTBRK" caption="External Break Request" mask="0xC000"/>
        </register>
        <register-group name="CTIS" name-in-module="CTIS" offset="0x10" count="3"/>
        <register name="INTSTATUS" offset="0x20" rw="R" size="1" count="31" initval="0x00" caption="Interrupt n Status">
          <bitfield name="IRQ0" caption="Interrupt Status for Interrupt Request 0 within Interrupt n" mask="0x1"/>
          <bitfield name="IRQ1" caption="Interrupt Status for Interrupt Request 1 within Interrupt n" mask="0x2"/>
          <bitfield name="IRQ2" caption="Interrupt Status for Interrupt Request 2 within Interrupt n" mask="0x4"/>
          <bitfield name="IRQ3" caption="Interrupt Status for Interrupt Request 3 within Interrupt n" mask="0x8"/>
          <bitfield name="IRQ4" caption="Interrupt Status for Interrupt Request 4 within Interrupt n" mask="0x10"/>
          <bitfield name="IRQ5" caption="Interrupt Status for Interrupt Request 5 within Interrupt n" mask="0x20"/>
          <bitfield name="IRQ6" caption="Interrupt Status for Interrupt Request 6 within Interrupt n" mask="0x40"/>
          <bitfield name="IRQ7" caption="Interrupt Status for Interrupt Request 7 within Interrupt n" mask="0x80"/>
        </register>
        <register name="IRQTRIG" offset="0x60" rw="RW" size="2" initval="0x0000" caption="Interrupt Trigger">
          <bitfield name="ENABLE" caption="Trigger Enable" mask="0x1"/>
          <bitfield name="IRQNUM" caption="Interrupt Request Number" mask="0x3E"/>
          <bitfield name="OVERRIDE" caption="Interrupt Request Override Value" mask="0xFF00"/>
        </register>
        <register name="CPUIRQS" offset="0x64" rw="R" size="4" count="1" initval="0x00000000" caption="Interrupt Status for CPU n">
          <bitfield name="CPUIRQS" caption="Interrupt Requests for CPU n" mask="0x7FFFFFFF"/>
        </register>
      </register-group>
      <value-group name="TAL_CTICTRLA__ACTION">
        <value name="BREAK" caption="Break when requested" value="0"/>
        <value name="INTERRUPT" caption="Trigger DBG interrupt instead of break" value="1"/>
        <value name="IGNORE" caption="Ignore break request" value="2"/>
      </value-group>
    </module>
    <module name="TC" id="U2249" version="2.0.0" caption="Basic Timer Counter">
      <register-group class="union" union-tag="TC.CTRLA.MODE" name="TC" caption="Basic Timer Counter">
        <register-group name="COUNT8" name-in-module="TC_COUNT8" union-tag-value="1" offset="0"/>
